Tekla.Structures.Analysis.AnalysisDesignCode
The AnalysisDesignCode class contains information related to analysis design codes.

Tekla.Structures.Analysis.AnalysisDesignCode.name
The name of the analysis design code.

Tekla.Structures.Analysis.AnalysisDesignCode.materialType
The material type of the analysis analysis design code.

Tekla.Structures.Analysis.AnalysisDesignCode.id
The identifier of the analysis design code.

Tekla.Structures.Analysis.AnalysisDesignCode.designParameters
The design parameters of the analysis design code.

Tekla.Structures.Analysis.AnalysisDesignCode.Name
Gets the name of the analysis design code.

Tekla.Structures.Analysis.AnalysisDesignCode.MaterialType
Gets the material type of the analysis analysis design code.

Tekla.Structures.Analysis.AnalysisDesignCode.ID
Gets or sets the identifier of the analysis design code.

Tekla.Structures.Analysis.AnalysisDesignCode.DesignParameters
Gets or sets the design parameters of the analysis design code.